# Criando os nomes

In [2]:
import pandas as pd

In [9]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [8]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [10]:
nomes_f.sample(5)

          nome  regiao     freq  rank sexo
67       PAULA       0   221113    68    F
1          ANA       0  3079729     2    F
96       TANIA       0   172242    97    F
55     DANIELE       0   251469    56    F
170  MARINALVA       0    93355   171    F

In [11]:
nomes_m.sample(5)

          nome  regiao    freq  rank sexo
76   CRISTIANO       0  194300    77    M
135     RUBENS       0  105396   136    M
143     OTAVIO       0   99962   144    M
51     ROGERIO       0  292635    52    M
133       RUAN       0  108527   134    M

In [12]:
print('Quantidade de nomes: {}'.format(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [13]:
frames = [nomes_f, nomes_m]

In [18]:
nomes = pd.concat(frames)['nome'].to_frame()

In [22]:
nomes.sample(5)

          nome
39        ROSA
22     VITORIA
177  CLAUDINEI
180       EDER
7        LUCAS

# Incluindo ID dos alunos

In [24]:
import numpy as np

In [27]:
np.random.seed(123)

In [29]:
total_alunos = len(nomes)
total_alunos

400

In [30]:
nomes['ID Aluno'] = np.random.permutation(total_alunos) + 1

In [31]:
nomes

          nome  ID Aluno
0        MARIA       235
1          ANA        43
2    FRANCISCA       304
3      ANTONIA       156
4      ADRIANA       343
..         ...       ...
195     WALTER       231
196    ARLINDO        99
197    MICHAEL       323
198     ALVARO       383
199    GEOVANE       366

[400 rows x 2 columns]

In [32]:
dominios = ['@gmail.com', '@hotmail.com']
nomes['Domínio'] = np.random.choice(dominios, total_alunos)
nomes

          nome  ID Aluno       Domínio
0        MARIA       235    @gmail.com
1          ANA        43  @hotmail.com
2    FRANCISCA       304  @hotmail.com
3      ANTONIA       156  @hotmail.com
4      ADRIANA       343  @hotmail.com
..         ...       ...           ...
195     WALTER       231    @gmail.com
196    ARLINDO        99  @hotmail.com
197    MICHAEL       323    @gmail.com
198     ALVARO       383  @hotmail.com
199    GEOVANE       366  @hotmail.com

[400 rows x 3 columns]

In [33]:
nomes['E-mail'] = nomes.nome.str.cat(nomes['Domínio']).str.lower()

In [34]:
nomes.head(5)

        nome  ID Aluno       Domínio                 E-mail
0      MARIA       235    @gmail.com        maria@gmail.com
1        ANA        43  @hotmail.com        ana@hotmail.com
2  FRANCISCA       304  @hotmail.com  francisca@hotmail.com
3    ANTONIA       156  @hotmail.com    antonia@hotmail.com
4    ADRIANA       343  @hotmail.com    adriana@hotmail.com